[{"password": "", "message": ["Password must be 8 or more characters in length. Password must contain 1 or more uppercase characters. Password must contain 1 or more lowercase characters. Password must contain 1 or more digit characters. Password must contain 1 or more special characters.", "must not be blank"]},
{"password": " ", "message":["must not be blank", "Password must be 8 or more characters in length. Password must contain 1 or more uppercase characters. Password must contain 1 or more lowercase characters. Password must contain 1 or more digit characters. Password must contain 1 or more special characters. Password contains a whitespace character."]},
{"password": "1", "message": ["Password must be 8 or more characters in length. Password must contain 1 or more uppercase characters. Password must contain 1 or more lowercase characters. Password must contain 1 or more special characters."]},
{"password": "1a", "message": ["Password must be 8 or more characters in length. Password must contain 1 or more uppercase characters. Password must contain 1 or more special characters."]},
{"password": "1a!", "message": ["Password must be 8 or more characters in length. Password must contain 1 or more uppercase characters."]},
{"password": "1a!A", "message": ["Password must be 8 or more characters in length."]},
{"password": "!!!!!!!!", "message": ["Password must contain 1 or more uppercase characters. Password must contain 1 or more lowercase characters. Password must contain 1 or more digit characters."]},
{"password": "aaaaaaaa", "message": ["Password must contain 1 or more uppercase characters. Password must contain 1 or more digit characters. Password must contain 1 or more special characters."]},
{"password": "AAAAAAAA", "message": ["Password must contain 1 or more lowercase characters. Password must contain 1 or more digit characters. Password must contain 1 or more special characters."]},
{"password": "12345678", "message": ["Password must contain 1 or more uppercase characters. Password must contain 1 or more lowercase characters. Password must contain 1 or more special characters."]},
{"password": "12345678!", "message": ["Password must contain 1 or more uppercase characters. Password must contain 1 or more lowercase characters."]},
{"password": "12345678!a", "message": ["Password must contain 1 or more uppercase characters."]},
{"password": "1rvh34iuBv3o4voubjba!", "message": ["Password must be no more than 20 characters in length."]}]